{"consistency_rules":["A fact must not directly contradict a previously established fact about the same entity or attribute.","If two attributes are inversely related (e.g., hot vs. cold), a single subject cannot simultaneously hold both unless explicitly time-bounded or context-separated.","Units for a numeric attribute must be consistent within a statement; mixed units require explicit conversion or distinction.","A classification must respect hierarchical taxonomy (e.g., a whale cannot be both a mammal and a fish)."],"temporal_rules":["Events must be ordered chronologically when causally linked (cause precedes effect).","A subject cannot occupy mutually exclusive states at the same time unless time indices differ (e.g., open vs. closed).","Persistent states (e.g., geological formations) should not flip instantaneously without explicit temporal markers.","Seasonal or periodic events must align with their cycles (e.g., floods during rainy season) unless an anomaly is specified."],"causal_rules":["Causes must be present before their effects and be plausible within known mechanisms (e.g., heating water causes boiling above boiling point at given pressure).","Absence of a required cause invalidates the claimed effect (no fuel -> no combustion).","Correlation does not imply causation; causal claims need a mechanism or evidentiary support.","Single causes should not yield mutually exclusive effects on the same subject at the same time."],"numeric_bounds":["Physical quantities must respect known bounds (e.g., human body temperature typically 35C-42C; Earth sea-level air pressure about 80-110 kPa).","Probabilities range from 0 to 1 inclusive; percentages from 0 to 100 inclusive.","Speeds on Earth's surface for physical objects should not exceed feasible limits (e.g., walking humans under 15 km/h sustained, commercial aircraft under 1200 km/h cruise).","Populations or counts must be non-negative integers unless modeling expectations or rates."],"existence_rules":["Entities claimed to act must exist within the described timeframe and setting (no extinct species in present-day contexts).","Locations must exist geographically (no fictional continents in real-world claims).","Processes must be applicable to the described materials (e.g., photosynthesis applies to organisms with appropriate pigments).","Artifacts or technologies must exist historically before being referenced (no smartphones in medieval periods)."],"contradiction_rules":["If two statements assert mutually exclusive properties (e.g., X is liquid vs. X is solid at same conditions), they cannot both hold unless conditions differ.","A statement is contradicted by its logical negation unless disambiguated by time, conditions, or scope.","Numerical contradictions occur when overlapping intervals do not intersect (e.g., height >2m and <1m simultaneously for same subject/time).","Taxonomic contradictions arise when an entity is placed in incompatible categories (e.g., bird and mammal) without hybrid explanation."]}
