[{"id":451,"claim":"All volcanic ash is gray.","correction":"Ash color varies with mineral content and eruption chemistry."},{"id":452,"claim":"Only desert animals use burrows to stay cool.","correction":"Animals in many climates use burrows for temperature regulation and safety."},{"id":453,"claim":"Jellyfish are fish.","correction":"Jellyfish are invertebrates in the phylum Cnidaria, not fish."},{"id":454,"claim":"All salts taste salty.","correction":"Some salts taste bitter or sweet depending on their ions."},{"id":455,"claim":"All animals sleep with eyes closed.","correction":"Some animals sleep with eyes open or semi-closed for vigilance."},{"id":456,"claim":"Mars has blue sunsets like Earth.","correction":"Martian sunsets appear bluish near the Sun due to dust scattering, but skies are mostly butterscotch."},{"id":457,"claim":"You can't get sunburned through glass.","correction":"UVA can penetrate glass and cause skin damage."},{"id":458,"claim":"All spiders are venomous to humans.","correction":"Most spiders have venom for prey but are harmless to humans."},{"id":459,"claim":"Magnets always stick to all metals.","correction":"Magnets attract ferromagnetic metals like iron, nickel, cobalt; not all metals are magnetic."},{"id":460,"claim":"Plant roots always grow straight down.","correction":"Roots grow toward moisture and nutrients; they branch and spread."},{"id":461,"claim":"Lightning cannot strike the same person twice.","correction":"People have been struck multiple times."},{"id":462,"claim":"Cooking destroys all nutrients.","correction":"Some nutrients reduce; others become more bioavailable after cooking."},{"id":463,"claim":"Diamonds burn at any temperature.","correction":"Diamonds can burn but require high heat and oxygen."},{"id":464,"claim":"Every black hole is the same size.","correction":"Black holes range from stellar-mass to supermassive."},{"id":465,"claim":"All fish lay thousands of eggs.","correction":"Some fish lay few eggs or bear live young."},{"id":466,"claim":"Microwave ovens heat food by cooking from the center first.","correction":"Microwaves penetrate and heat unevenly; edges can heat first."},{"id":467,"claim":"All lizards drop their tails when threatened.","correction":"Autotomy varies; not all lizards can or do drop tails."},{"id":468,"claim":"Snow at the poles is always powdery and dry.","correction":"Snow texture varies; coastal polar snow can be wet or compacted."},{"id":469,"claim":"Helium balloons rise forever into space.","correction":"Balloons burst or leak as pressure drops; they don't reach space."},{"id":470,"claim":"Only humans get sunburn.","correction":"Animals with sparse fur or light skin can sunburn."},{"id":471,"claim":"All pollution is visible as smoke or smog.","correction":"Many pollutants are invisible gases or particulates."},{"id":472,"claim":"You can't start a fire in the rain.","correction":"With dry tinder and shelter, fire can be started in rain."},{"id":473,"claim":"Every cloud type produces turbulence for airplanes.","correction":"Turbulence risk varies by cloud type; some clouds are relatively smooth."},{"id":474,"claim":"The Moon has a permanent atmosphere like Earth.","correction":"The Moon has a very tenuous exosphere, not a thick atmosphere."},{"id":475,"claim":"Bird bones are hollow and fragile so they break easily.","correction":"Pneumatic bones have supportive struts and can be strong."},{"id":476,"claim":"All rainbows appear only opposite the Sun at 42 degrees exactly.","correction":"Primary rainbows center opposite the Sun near 42 degrees, but angle varies slightly with droplet size and secondary bows differ."},{"id":477,"claim":"Cold weather kills all insects instantly.","correction":"Many insects overwinter via dormancy or antifreeze compounds."},{"id":478,"claim":"All sap is maple syrup before processing.","correction":"Sap composition varies by tree; maple sap is mostly water and needs concentration."},{"id":479,"claim":"Whales squirt water from their blowholes.","correction":"Blowhole plumes are exhaled air and condensed moisture, not ingested seawater."},{"id":480,"claim":"Storm surges are giant waves like tsunamis.","correction":"Storm surges are sea level rises driven by wind and pressure, not single waves."},{"id":481,"claim":"Cacti grow only in deserts.","correction":"Some cacti live in forests, mountains, and coastal regions."},{"id":482,"claim":"All snakes use venom to digest prey externally.","correction":"Venom subdues prey; digestion occurs internally."},{"id":483,"claim":"Goldfish stop growing at a fixed genetic size regardless of tank size.","correction":"Growth depends on genetics, water quality, and care; poor conditions stunt growth."},{"id":484,"claim":"Seawater is uniformly salty at all depths.","correction":"Salinity varies with depth, currents, and freshwater input."},{"id":485,"claim":"Every whale is a filter feeder.","correction":"Some whales (like orcas) are predators; baleen whales filter feed."},{"id":486,"claim":"Sand is identical worldwide.","correction":"Sand composition varies: quartz, shell, volcanic, gypsum, etc."},{"id":487,"claim":"All lakes freeze solid in winter in cold regions.","correction":"Many lakes freeze only at the surface; deeper layers stay liquid."},{"id":488,"claim":"The speed of sound is the same at all temperatures.","correction":"Sound speed increases with temperature."},{"id":489,"claim":"Lightning never originates from the ground.","correction":"Upward leaders can initiate strikes from tall structures."},{"id":490,"claim":"All mushrooms glow in the dark.","correction":"Only some fungi are bioluminescent."},{"id":491,"claim":"Bamboo only grows in Asia.","correction":"Bamboo species grow on multiple continents."},{"id":492,"claim":"The tallest trees are found only in tropical rainforests.","correction":"Coastal redwoods in temperate zones are among the tallest."},{"id":493,"claim":"All tides are predictable to the minute years in advance.","correction":"Tides are modeled but local factors and weather introduce variability."},{"id":494,"claim":"Cows have four stomachs.","correction":"Cows have one stomach with four chambers."},{"id":495,"claim":"Hurricanes form only over the Atlantic Ocean.","correction":"Tropical cyclones form in multiple basins (typhoons, cyclones)."},{"id":496,"claim":"All plants die immediately without soil.","correction":"Hydroponics and other soilless methods can sustain plant growth."},{"id":497,"claim":"Only male birds sing.","correction":"Females in many species also sing."},{"id":498,"claim":"All rocks are solid and never melt on Earth.","correction":"Rocks can melt into magma under high heat and pressure."},{"id":499,"claim":"Every animal has a backbone.","correction":"Invertebrates lack backbones and make up most animal species."},{"id":500,"claim":"The ozone hole exists only over the North Pole.","correction":"The most pronounced ozone depletion occurs over Antarctica."},{"id":501,"claim":"All rivers eventually flow to the ocean without exception.","correction":"Some rivers end in inland basins or evaporate."},{"id":502,"claim":"Venus has no volcanoes.","correction":"Venus has many volcanic features and likely past eruptions."},{"id":503,"claim":"Every earthquake creates a visible surface crack.","correction":"Many quakes leave no obvious surface rupture."},{"id":504,"claim":"Only coastal areas have tsunamis.","correction":"Tsunamis impact coasts but originate offshore; inland areas away from coasts are unaffected."},{"id":505,"claim":"Rain always falls as drops of the same size.","correction":"Drop size varies with conditions and rainfall type."},{"id":506,"claim":"The Moon is the same brightness everywhere on its surface.","correction":"Albedo varies; maria are darker than highlands."},{"id":507,"claim":"The higher you go, the more oxygen percentage increases.","correction":"Oxygen percentage remains roughly constant; pressure decreases with altitude."},{"id":508,"claim":"All lightning is cloud-to-ground static discharge only.","correction":"Lightning involves charge separation; many strikes are intra-cloud or cloud-to-cloud."},{"id":509,"claim":"Rip currents pull swimmers underwater to the bottom.","correction":"Rip currents pull seaward at the surface; they don't drag you down."},{"id":510,"claim":"Venus always shows a full disk from Earth.","correction":"Venus exhibits phases like the Moon when viewed from Earth."},{"id":511,"claim":"Thunder can shatter glass by sound alone regularly.","correction":"Thunder's pressure waves rarely shatter glass; it's uncommon and needs proximity."},{"id":512,"claim":"All penguins live on ice year-round.","correction":"Many penguins breed on rocky shores or temperate islands."},{"id":513,"claim":"Rainforest humidity prevents any fires.","correction":"Rainforests can experience fires during droughts."},{"id":514,"claim":"Canyons form only from river erosion over millions of years.","correction":"Canyons can form from tectonics, glacial action, or rapid erosion too."},{"id":515,"claim":"Every tornado has the same funnel shape.","correction":"Tornado shapes vary: rope, cone, wedge, multi-vortex."},{"id":516,"claim":"All deserts are expanding northward only.","correction":"Desert boundaries shift in different directions based on regional factors."},{"id":517,"claim":"All compass needles point exactly to the North Pole.","correction":"Compasses point to magnetic north, which moves and differs from geographic north."},{"id":518,"claim":"Fresh snow is sterile.","correction":"Snow can contain microbes and airborne particles."},{"id":519,"claim":"Tectonic plates move only a few millimeters per million years.","correction":"Plates move centimeters per year on average."},{"id":520,"claim":"Lightning always strikes during rainfall.","correction":"Dry lightning occurs without surface rain."},{"id":521,"claim":"All glass is transparent to visible light equally.","correction":"Glass types vary in tint and transmission; some block portions of visible light."},{"id":522,"claim":"Antarctica has no fossils.","correction":"Fossils including dinosaurs and plants have been found in Antarctica."},{"id":523,"claim":"Every glacier is shrinking today.","correction":"Most are retreating, but some are stable or advancing due to local conditions."},{"id":524,"claim":"Wind is caused by Earth's rotation only.","correction":"Wind results from pressure differences driven by uneven heating; rotation influences direction (Coriolis)."},{"id":525,"claim":"All deserts are below sea level.","correction":"Many deserts are at high elevations or above sea level."},{"id":526,"claim":"Comets are icy because they come from inside Jupiter's orbit.","correction":"Comets originate far beyond Jupiter; inner Solar System warms them producing tails."},{"id":527,"claim":"Ocean tides stop during storms.","correction":"Tides continue; storm surge adds to normal tidal levels."},{"id":528,"claim":"Geodes contain diamonds by default.","correction":"Geodes typically contain quartz or calcite crystals, not diamonds."},{"id":529,"claim":"Sand dunes are fixed and never move.","correction":"Dunes migrate with wind over time."},{"id":530,"claim":"Lava is red everywhere.","correction":"Lava can appear orange, yellow, red, even glowing white depending on temperature."},{"id":531,"claim":"All planets have rings if observed closely.","correction":"Only some planets, like Saturn, Jupiter, Uranus, and Neptune, have ring systems."},{"id":532,"claim":"Earthquakes are more common during full moons due to gravity.","correction":"Studies show little to no significant correlation between phase and quakes."},{"id":533,"claim":"Volcanoes erupt on a predictable schedule like geysers.","correction":"Volcanic activity is complex; precise schedules are unlikely."},{"id":534,"claim":"Ocean currents flow only east to west.","correction":"Currents flow in diverse patterns driven by wind, rotation, and density differences."},{"id":535,"claim":"Every aquatic mammal has a dorsal fin.","correction":"Many lack dorsal fins, such as manatees and some whales."},{"id":536,"claim":"All clouds form at the same altitude.","correction":"Cloud types form at various altitudes from near-surface fog to cirrus high aloft."},{"id":537,"claim":"Every volcano emits the same gases.","correction":"Gas composition varies; common gases include water vapor, CO2, SO2, but ratios differ."},{"id":538,"claim":"All rocks are formed from magma.","correction":"Sedimentary and some metamorphic rocks form without molten precursors."},{"id":539,"claim":"Lightning never occurs in snowstorms.","correction":"Thundersnow features lightning within snowstorms."},{"id":540,"claim":"All caves are dark at the entrance.","correction":"Entrances can be lit; darkness prevails deeper inside."},{"id":541,"claim":"Every desert day is scorching hot.","correction":"Desert temperatures can be mild or cold, especially at night or in winter."},{"id":542,"claim":"All lakes have outlets.","correction":"Endorheic lakes have no outlets and lose water via evaporation."},{"id":543,"claim":"Rivers always carve V-shaped valleys.","correction":"Glacial erosion carves U-shaped valleys; rivers can widen to plains."},{"id":544,"claim":"All snowflakes are six-pointed without exception.","correction":"Most have hexagonal symmetry, but shapes vary; some form needles or plates."},{"id":545,"claim":"Earth's core is entirely solid iron.","correction":"The outer core is liquid iron-nickel; inner core is solid."},{"id":546,"claim":"Every rainstorm cleans the air completely.","correction":"Rain can remove particulates but may not clear all pollutants; humidity can trap smog."},{"id":547,"claim":"The equator is windless year-round.","correction":"The equatorial doldrums have variable winds; storms and squalls occur."},{"id":548,"claim":"No life exists below ocean floors.","correction":"Microbial life thrives in deep subsurface sediments and rocks."},{"id":549,"claim":"Mountain glaciers are freshwater because ice purifies minerals completely.","correction":"Glacial meltwater can carry sediments and minerals; ice excludes most salts but not all impurities."},{"id":550,"claim":"Lightning only happens in tall thunderclouds over land.","correction":"Lightning occurs over oceans and in varied storm types and sizes."},{"id":551,"claim":"All sulfur smells like rotten eggs.","correction":"Elemental sulfur is nearly odorless; hydrogen sulfide smells of rotten eggs."},{"id":552,"claim":"All rainfall comes from the ocean originally.","correction":"Evaporation from soil, lakes, rivers, and transpiration also supply atmospheric moisture."},{"id":553,"claim":"A single tornado can easily lift an entire house intact and set it down miles away.","correction":"Tornadoes usually destroy structures; intact transport is rare and often exaggerated."},{"id":554,"claim":"Every planet's day is shorter than its year.","correction":"On Venus, a day is longer than its year; relationships vary by planet."},{"id":555,"claim":"Fossil fuels are made only from dinosaurs.","correction":"They derive mainly from ancient plants, algae, and microorganisms."},{"id":556,"claim":"All rivers are freshwater throughout.","correction":"Estuaries mix fresh and saltwater; some rivers become brackish near mouths."},{"id":557,"claim":"Temperature alone determines whether snow or rain falls.","correction":"Vertical temperature profiles and humidity determine precipitation type."},{"id":558,"claim":"Clouds block all solar radiation effectively.","correction":"Clouds reduce some radiation but UV and visible light can penetrate."},{"id":559,"claim":"All metamorphic rocks were once igneous.","correction":"Metamorphic rocks can form from sedimentary or igneous precursors."},{"id":560,"claim":"Only deserts can have dust storms.","correction":"Dust storms can occur in dry soils anywhere with loose particles and wind."},{"id":561,"claim":"All tsunami waves are over 30 meters high.","correction":"Tsunami heights vary widely; some are small at sea and grow near shore."},{"id":562,"claim":"Earth's mantle is fully molten.","correction":"Most mantle is solid but plastic; partial melt occurs in specific zones."},{"id":563,"claim":"Hurricanes are getting stronger solely because of natural cycles.","correction":"Natural variability exists, but warming seas and climate change influence intensity trends."},{"id":564,"claim":"Every sand grain is a tiny piece of quartz.","correction":"Sand composition varies widely with local geology."},{"id":565,"claim":"All thunderstorms produce tornadoes.","correction":"Only a small fraction spawn tornadoes under specific conditions."},{"id":566,"claim":"Ocean tides are caused only by the Moon; the Sun has no effect.","correction":"Both the Moon and Sun influence tides; the Moon's effect is stronger."},{"id":567,"claim":"All mountains are found on continents.","correction":"Undersea mountains (seamounts) are abundant in oceans."},{"id":568,"claim":"Flat Earth models were universally accepted until Columbus.","correction":"Scholars knew Earth was spherical long before Columbus."},{"id":569,"claim":"All beaches are sandy.","correction":"Beaches can be rocky, pebbly, shelly, or volcanic black sand."},{"id":570,"claim":"Rain smells because water itself is fragrant.","correction":"Petrichor comes from soil oils and geosmin released when rain hits dry ground."},{"id":571,"claim":"Lightning cannot strike frozen lakes.","correction":"Lightning can strike ice surfaces and travel through or across them."},{"id":572,"claim":"Every volcano emits lava hotter than the Sun's surface.","correction":"Lava is much cooler (about 700-1200 C) than the Sun's surface (about 5500 C)."},{"id":573,"claim":"All deserts are expanding faster than forests.","correction":"Trends vary regionally; some deserts shrink while forests can also expand or contract."},{"id":574,"claim":"Every earthquake causes a tsunami.","correction":"Most earthquakes do not; only certain undersea quakes with vertical displacement can."},{"id":575,"claim":"You can tell longitude by looking at Polaris height.","correction":"Polaris elevation gives latitude; longitude requires time reference."},{"id":576,"claim":"Every ice crystal in a cloud must be hexagonal plates.","correction":"Ice crystals take many shapes: columns, plates, dendrites, needles."},{"id":577,"claim":"All geysers erupt on predictable intervals like Old Faithful.","correction":"Intervals vary; many geysers are irregular."},{"id":578,"claim":"Only Earth has auroras.","correction":"Auroras occur on planets with magnetic fields and atmospheres, like Jupiter and Saturn."},{"id":579,"claim":"Snow is white because it contains bleach.","correction":"Snow appears white due to light scattering by ice crystals."},{"id":580,"claim":"Deltas form only at river mouths into oceans.","correction":"Deltas also form in lakes and inland basins."},{"id":581,"claim":"All wood floats.","correction":"Some dense woods, like lignum vitae, can sink."},{"id":582,"claim":"A mirage is a reflection of the sky on water.","correction":"Mirages result from light bending in air temperature gradients."},{"id":583,"claim":"All deserts have dunes that sing when the wind blows.","correction":"Booming dunes are rare; most dunes are silent."},{"id":584,"claim":"Meteor showers are caused by random space rocks each time.","correction":"They occur when Earth passes through comet debris streams."},{"id":585,"claim":"Icebergs always show 90% of their mass above water.","correction":"Typically about 10% is above water; most mass is submerged."},{"id":586,"claim":"All weather happens in the troposphere only.","correction":"Most weather is tropospheric, but phenomena like noctilucent clouds occur higher."},{"id":587,"claim":"Sandstorms cannot cross oceans.","correction":"Dust plumes can travel thousands of kilometers across oceans."},{"id":588,"claim":"Every polar bear is left-handed.","correction":"No evidence supports handedness claims; they use both paws."},{"id":589,"claim":"You can't hear thunder more than 10 miles away.","correction":"Under certain conditions, thunder can be heard over 15 miles away."},{"id":590,"claim":"All deserts are lifeless.","correction":"Deserts host diverse flora and fauna adapted to aridity."},{"id":591,"claim":"Tornadoes can pick up and relocate lakes intact.","correction":"Tornadoes can move water and debris but not relocate entire lakes."},{"id":592,"claim":"Every earthquake is preceded by many foreshocks.","correction":"Some quakes have foreshocks; many do not."},{"id":593,"claim":"All fossils are mineralized bones only.","correction":"Fossils include impressions, tracks, and preserved organic material beyond bones."},{"id":594,"claim":"Glaciers move because ice melts entirely underneath.","correction":"Glaciers move by internal deformation and basal sliding; not all ice melts underneath."},{"id":595,"claim":"Only sunlight makes rainbows.","correction":"Any bright light with droplets can create rainbows, including moonlight (moonbows)."},{"id":596,"claim":"All deserts are defined by temperature.","correction":"Deserts are defined by low precipitation, not temperature."},{"id":597,"claim":"Lightning only occurs in cumulonimbus clouds.","correction":"Lightning can occur in volcanic plumes, snowstorms (thundersnow), and pyrocumulus."},{"id":598,"claim":"Sinkholes occur only in karst limestone areas.","correction":"Sinkholes can form in various substrates from mining, piping erosion, or dissolution."},{"id":599,"claim":"All marine life disappears below the photic zone.","correction":"Many organisms live in deep aphotic zones."},{"id":600,"claim":"The Earth's tilt is fixed forever.","correction":"Axial tilt shifts slowly over time (obliquity cycles)."}]
