[{"id":151,"claim":"Lightning never strikes the ocean.","correction":"Lightning frequently strikes the ocean; water conducts the current broadly."},{"id":152,"claim":"All volcanoes are explosive.","correction":"Many volcanoes erupt effusively with flowing lava rather than explosive blasts."},{"id":153,"claim":"Humans can photosynthesize small amounts of energy from sunlight.","correction":"Humans cannot photosynthesize; we rely on food for energy."},{"id":154,"claim":"Antarctica is a country with citizens.","correction":"Antarctica has no sovereign nation; it’s governed by international treaty with no native population."},{"id":155,"claim":"Birds refuse to cross the equator.","correction":"Many migratory birds routinely cross the equator."},{"id":156,"claim":"The Sun is yellow from space.","correction":"From space the Sun appears white; Earth’s atmosphere scatters light making it look yellow."},{"id":157,"claim":"Eating at night always causes weight gain regardless of calories.","correction":"Weight change depends on total calorie balance, not clock time alone."},{"id":158,"claim":"Earth’s atmosphere ends sharply at the Kármán line.","correction":"The atmosphere thins gradually with no sharp boundary."},{"id":159,"claim":"Spin dryers spin because of centrifugal force pushing outward.","correction":"Clothes are held against the drum by centripetal force; water exits tangentially."},{"id":160,"claim":"Pyramids were built with alien technology.","correction":"Pyramids were built by human engineering and labor."},{"id":161,"claim":"All ancient people thought Earth was flat.","correction":"Many ancient scholars recognized Earth as spherical."},{"id":162,"claim":"Clouds are weightless.","correction":"Clouds can weigh millions of kilograms but remain aloft due to air currents and buoyancy."},{"id":163,"claim":"Humans cannot grow new brain cells after childhood.","correction":"Neurogenesis occurs in certain brain regions throughout life."},{"id":164,"claim":"Brown sugar is healthier than white sugar.","correction":"Nutritional differences are minimal; both are mostly sucrose."},{"id":165,"claim":"Earth is perfectly aligned in its orbit.","correction":"Earth’s orbit is slightly elliptical and its axial tilt precesses over time."},{"id":166,"claim":"The Internet and the World Wide Web are identical.","correction":"The Internet is the network infrastructure; the Web is one service on it."},{"id":167,"claim":"Hair and nails keep growing after death.","correction":"Skin retracts after death, giving the appearance of growth; actual growth stops."},{"id":168,"claim":"Sunflowers always face the Sun all day, even when mature.","correction":"Mature sunflowers usually face east; heliotropism is mainly in buds."},{"id":169,"claim":"All deserts are sandy dunes.","correction":"Deserts can be rocky, icy, or gravel plains with sparse sand."},{"id":170,"claim":"The Moon has a permanently dark side.","correction":"The Moon’s far side gets sunlight; it is simply always facing away from Earth."},{"id":171,"claim":"Owls are the only birds that rotate heads widely.","correction":"Other birds have flexible necks, though owls have exceptional range."},{"id":172,"claim":"Sharks don’t get cancer.","correction":"Sharks can develop cancers."},{"id":173,"claim":"All pearls come from oysters naturally.","correction":"Many pearls are cultured; pearls also come from other mollusks."},{"id":174,"claim":"Dolphins are fish.","correction":"Dolphins are mammals."},{"id":175,"claim":"Sound travels faster in cold air than warm air.","correction":"Sound travels faster in warm air because molecules move more quickly."},{"id":176,"claim":"Gold is created in Earth’s core regularly.","correction":"Most gold formed in stellar processes like supernovae and neutron-star mergers."},{"id":177,"claim":"Rubber tires protect cars fully from lightning.","correction":"Car metal frames and Faraday cage effect provide protection, not rubber tires."},{"id":178,"claim":"Carrots were originally purple due to a genetic accident in the 1900s.","correction":"Cultivated carrots were historically purple, yellow, and white centuries ago; orange types were later selected."},{"id":179,"claim":"Some humans naturally have gills.","correction":"Humans do not have functional gills; branchial remnants can appear only as anomalies."},{"id":180,"claim":"The equator is the hottest place on Earth at all times.","correction":"Hottest temperatures often occur in subtropical deserts, not exactly on the equator."},{"id":181,"claim":"A goldfish will grow only as big as its bowl allows without health issues.","correction":"Small bowls harm fish; stunted growth is unhealthy."},{"id":182,"claim":"Whispering makes you lose your voice faster than yelling.","correction":"Whispering can strain vocal cords if forced, but yelling generally strains more."},{"id":183,"claim":"Thunderstorms cannot produce hail in tropical regions.","correction":"Strong tropical storms can produce hail at high altitudes."},{"id":184,"claim":"Chewing ice always indicates iron deficiency.","correction":"Ice chewing (pagophagia) can be linked to deficiencies but also habits; diagnosis requires evaluation."},{"id":185,"claim":"Fingerprints never change throughout life.","correction":"They are largely stable but can change with scars, growth, or skin conditions."},{"id":186,"claim":"All mushrooms are safe if animals eat them.","correction":"Animals may tolerate toxins humans cannot; animal consumption doesn’t guarantee safety."},{"id":187,"claim":"Toilet seats are the germiest surfaces in bathrooms.","correction":"Sink handles, faucet knobs, and phone screens often harbor more microbes."},{"id":188,"claim":"Boiling water removes heavy metals.","correction":"Boiling does not remove heavy metals; filtration or treatment is required."},{"id":189,"claim":"Antarctica has no liquid water anywhere.","correction":"Liquid water exists in subglacial lakes and summer melt streams."},{"id":190,"claim":"All tides occur twice per day universally.","correction":"Some coasts experience mixed or once-daily (diurnal) tides."},{"id":191,"claim":"Human blood is always red; other colors indicate alien biology.","correction":"Human blood can appear dark red; oxygenation changes shade but not color families."},{"id":192,"claim":"Water pressure crushes submarines instantly at any depth.","correction":"Submarines are engineered to withstand specific depths; beyond limits they risk implosion, not instantly everywhere."},{"id":193,"claim":"Every country drives on the right side of the road except the UK.","correction":"Several countries drive on the left, including Japan, Australia, India, and others."},{"id":194,"claim":"All rainwater is pure distilled water.","correction":"Rainwater dissolves gases and pollutants as it falls."},{"id":195,"claim":"Eating crusts makes hair curly.","correction":"Bread crusts do not affect hair texture."},{"id":196,"claim":"Lightning always strikes the tallest object nearby.","correction":"Lightning often targets tall or conductive paths but can strike lower objects."},{"id":197,"claim":"Icebergs are stationary until they melt in place.","correction":"Icebergs drift with currents and winds before melting."},{"id":198,"claim":"Humans and bananas share no DNA.","correction":"Humans share a significant portion of genes with many organisms, including bananas."},{"id":199,"claim":"Camouflage works only by matching color.","correction":"Camouflage uses color, pattern, texture, and behavior to break detection."},{"id":200,"claim":"Fire needs only fuel to burn.","correction":"Fire needs fuel, oxygen, and sufficient heat (the fire triangle)."},{"id":201,"claim":"Owning a cat reduces any risk of allergies later.","correction":"Pet exposure can influence allergy risk but does not universally reduce it."},{"id":202,"claim":"Diamonds are the hardest substance known without exception.","correction":"Materials like aggregated diamond nanorods and wurtzite boron nitride can be harder under specific conditions."},{"id":203,"claim":"Freshwater fish cannot live in saltwater under any conditions.","correction":"Some species (euryhaline) can adapt to different salinities."},{"id":204,"claim":"Lightning creates glass instantly in any sand.","correction":"Lightning can fuse silica sand into fulgurites, but not all sand forms glass."},{"id":205,"claim":"Humans have the strongest bite of all mammals.","correction":"Animals like hyenas and crocodilians have much stronger bite forces."},{"id":206,"claim":"All planets orbit the Sun on the same plane exactly.","correction":"Planetary orbits are inclined at various angles to the ecliptic."},{"id":207,"claim":"A candle flame is blue in zero gravity only.","correction":"Microgravity alters flame shape; color can vary with oxygen and fuel mix, not solely gravity."},{"id":208,"claim":"Mercury is the hottest planet because it’s closest to the Sun.","correction":"Venus is hotter due to its dense greenhouse atmosphere."},{"id":209,"claim":"Eating ice cream causes your body temperature to drop dangerously in winter.","correction":"Body temperature is regulated; ice cream does not cause dangerous drops in healthy people."},{"id":210,"claim":"All mirrors reverse left and right only.","correction":"Mirrors reverse front and back relative to the viewer; left-right reversal is perceptual."},{"id":211,"claim":"Snakes are deaf and cannot sense vibrations.","correction":"Snakes detect vibrations through the ground and inner ear structures."},{"id":212,"claim":"Astronauts float because there is no gravity in space.","correction":"They float because they are in continuous free fall around Earth."},{"id":213,"claim":"Every snowflake is completely unique at the molecular level.","correction":"Macroscopic shapes vary widely; identical small crystals can occur under controlled conditions."},{"id":214,"claim":"Caffeine dehydrates you overall.","correction":"Caffeine has mild diuretic effects, but moderate intake doesn’t dehydrate habitual users."},{"id":215,"claim":"Ducklings always imprint on humans if present.","correction":"Ducklings imprint on the first suitable moving caregiver; humans are one possibility."},{"id":216,"claim":"Sugar causes diabetes directly in all cases.","correction":"Diabetes involves genetics, lifestyle, and metabolic factors; excess calories contribute to risk but sugar alone is not sole cause."},{"id":217,"claim":"Concrete needs to dry rather than cure chemically.","correction":"Concrete hardens through hydration reactions, not drying."},{"id":218,"claim":"Stars twinkle in space just like on Earth.","correction":"In space, stars do not twinkle; twinkling is caused by Earth’s atmosphere."},{"id":219,"claim":"Every chemical with a long name is synthetic and harmful.","correction":"Long chemical names can belong to natural harmless substances; safety depends on properties, not name length."},{"id":220,"claim":"Houseplants always purify indoor air effectively for health standards.","correction":"Houseplants have minimal air-cleaning impact in typical indoor conditions; ventilation matters more."},{"id":221,"claim":"Hurricanes only rotate one direction everywhere.","correction":"Rotation depends on hemisphere: counterclockwise in the Northern, clockwise in the Southern."},{"id":222,"claim":"Touching a thermostat repeatedly speeds heating.","correction":"Thermostats control setpoint; toggling doesn’t heat faster."},{"id":223,"claim":"Venus has seasons similar to Earth.","correction":"Venus has minimal seasonal variation due to small axial tilt and thick atmosphere."},{"id":224,"claim":"You can’t get sunburned on cloudy days.","correction":"UV radiation penetrates clouds; sunburn can occur under overcast skies."},{"id":225,"claim":"Chili peppers burn your mouth by physically heating it.","correction":"Capsaicin activates pain receptors; the chemical isn’t hot in temperature."},{"id":226,"claim":"All bees can sting multiple times.","correction":"Honeybees usually die after stinging; many other bees can sting multiple times."},{"id":227,"claim":"Humans have the longest lifespan of all mammals.","correction":"Bowhead whales and some tortoises can live longer than humans."},{"id":228,"claim":"Time zones are the same width in every country.","correction":"Political borders create irregular time zone shapes and offsets."},{"id":229,"claim":"Milk always strengthens bones regardless of diet.","correction":"Bone health depends on overall nutrition, activity, and vitamin D, not milk alone."},{"id":230,"claim":"A full moon makes people behave irrationally by gravity effects.","correction":"Studies show no consistent link; moon gravity on individuals is negligible compared to Earth."},{"id":231,"claim":"Drowning victims always wave and shout for help.","correction":"Drowning often occurs silently with little surface movement."},{"id":232,"claim":"Giraffes have no vocal cords.","correction":"Giraffes have vocal cords and can make sounds, though rarely."},{"id":233,"claim":"All foods labeled 'natural' are chemical-free.","correction":"'Natural' foods still contain chemicals; the term is marketing and regulated loosely."},{"id":234,"claim":"You can see the Great Wall from the Moon with a telescope unaided.","correction":"High-resolution telescopes can see large structures, but the Wall is not easily distinguished; 'unaided' is incorrect."},{"id":235,"claim":"Birds explode if they eat uncooked rice at weddings.","correction":"Rice is safe; birds digest it without exploding."},{"id":236,"claim":"Shaving your head increases hair follicle count.","correction":"Follicle number is fixed; shaving does not increase it."},{"id":237,"claim":"If a magnet loses magnetism, freezing it will restore it fully.","correction":"Freezing doesn’t restore lost magnetization; re-magnetization requires a strong magnetic field."},{"id":238,"claim":"All clouds form from ocean evaporation only.","correction":"Clouds form from moisture from oceans, lakes, soil, plants, and other sources."},{"id":239,"claim":"The Amazon rainforest produces 20% of Earth’s oxygen used by humans.","correction":"Most produced oxygen is consumed within the ecosystem; net contribution to atmospheric O2 is small."},{"id":240,"claim":"All fruits contain more sugar than candy.","correction":"Fruits vary and often have less sugar per gram plus fiber compared to candy."},{"id":241,"claim":"Plane contrails are always evidence of chemical spraying.","correction":"Contrails are condensed water vapor from engine exhaust in cold air."},{"id":242,"claim":"Lightning can’t strike the same tree twice.","correction":"Lightning can strike the same object multiple times."},{"id":243,"claim":"GPS works by sending your location to satellites.","correction":"Satellites broadcast signals; receivers compute location from timing."},{"id":244,"claim":"All snakes lay eggs.","correction":"Some snakes give live birth (ovoviviparous or viviparous)."},{"id":245,"claim":"Wolves howl only at the full moon.","correction":"Wolves howl to communicate regardless of moon phase."},{"id":246,"claim":"Human taste buds detect only sweet, sour, salty, and bitter.","correction":"Umami is a basic taste; evidence suggests others like fat and kokumi as well."},{"id":247,"claim":"Deoxygenated blood is blue inside the body.","correction":"Deoxygenated blood is dark red; veins appear blue due to light scattering."},{"id":248,"claim":"The color red calms bulls and animals universally.","correction":"Color perception varies; behavior responses are context-dependent."},{"id":249,"claim":"Only plants can photosynthesize.","correction":"Some bacteria and algae also photosynthesize."},{"id":250,"claim":"Cats always land on their feet unharmed.","correction":"Cats often right themselves but can be injured or fail from certain heights."},{"id":251,"claim":"All fish need constant movement to breathe.","correction":"Many fish can pump water over gills while stationary."},{"id":252,"claim":"Drinking seawater in small amounts is safe and hydrating.","correction":"Seawater’s salinity dehydrates and strains kidneys."},{"id":253,"claim":"Tornadoes cannot cross rivers or mountains.","correction":"Tornadoes can cross rivers and terrain if conditions persist."},{"id":254,"claim":"Brainstorming always yields the best ideas in groups without critique.","correction":"Structured critique and diverse methods often improve idea quality."},{"id":255,"claim":"Organic produce is entirely pesticide-free.","correction":"Organic farming can use approved pesticides; residues may still exist."},{"id":256,"claim":"Fingerprint scanners store images of your fingerprints.","correction":"Most store encrypted feature templates, not full images."},{"id":257,"claim":"Blue whales are the largest animals ever because of bones only.","correction":"Their size is supported by buoyancy in water and efficient feeding, not bones alone."},{"id":258,"claim":"The North Star is the brightest star in the night sky.","correction":"Sirius is brighter; Polaris is notable for its position near the pole."},{"id":259,"claim":"All tides are identical height everywhere on Earth.","correction":"Tidal ranges vary widely due to geography and resonance."},{"id":260,"claim":"Eating bread crust improves eyesight.","correction":"Bread crust does not affect vision."},{"id":261,"claim":"A rooster’s crow is always at sunrise only.","correction":"Roosters crow at various times, responding to light and stimuli."},{"id":262,"claim":"The black box on airplanes is black.","correction":"Flight recorders are typically bright orange for visibility."},{"id":263,"claim":"All metals rust like iron.","correction":"Rust refers to iron oxidation; other metals corrode differently."},{"id":264,"claim":"Humans need eight glasses of water daily regardless of diet or environment.","correction":"Hydration needs vary with diet, climate, activity; many fluids and foods contribute."},{"id":265,"claim":"Wind turbines steal wind and change local climate drastically.","correction":"Turbines extract some kinetic energy with minimal broad climatic effect."},{"id":266,"claim":"Every planet has a solid surface beneath its atmosphere.","correction":"Gas giants like Jupiter lack a defined solid surface."},{"id":267,"claim":"Birds go to Florida for winter only.","correction":"Migratory routes vary widely; many species winter elsewhere."},{"id":268,"claim":"If glass breaks in large clumps it’s safety glass.","correction":"Tempered safety glass shatters into small pellets; laminated glass holds together."},{"id":269,"claim":"Anesthesia is just deep sleep.","correction":"General anesthesia is a controlled reversible coma with different brain activity than sleep."},{"id":270,"claim":"Plants need soil nutrients more than sunlight to survive.","correction":"Photosynthesis energy from light is essential; nutrients alone are insufficient."},{"id":271,"claim":"All owls are nocturnal.","correction":"Some owls are diurnal or crepuscular."},{"id":272,"claim":"Protein supplements always build muscle without exercise.","correction":"Muscle growth requires resistance training and balanced nutrition."},{"id":273,"claim":"All mollusks have shells.","correction":"Octopuses and slugs lack external shells."},{"id":274,"claim":"Sharks can stop moving if they sleep in caves for hours.","correction":"Some species can rest while pumping water; many must keep water flowing over gills."},{"id":275,"claim":"Every medieval person died by age 30.","correction":"Average life expectancy was low due to high infant mortality; many adults lived longer."},{"id":276,"claim":"Saturn could float on water because it’s light like a balloon.","correction":"Saturn’s average density is less than water, but its gravity would crush any container."},{"id":277,"claim":"The color of a planet indicates its temperature directly.","correction":"Planet color arises from atmosphere and surface properties, not solely temperature."},{"id":278,"claim":"Vaccines contain microchips for tracking.","correction":"Vaccines do not contain microchips; ingredients are well-documented."},{"id":279,"claim":"All rain is freshwater with no salts.","correction":"Rain contains dissolved gases and trace minerals but is far less saline than seawater."},{"id":280,"claim":"Space suits are airtight without any gas exchange systems.","correction":"Space suits are sealed and include regulated life support and ventilation."},{"id":281,"claim":"No spiders live in Antarctica.","correction":"Some spiders and mites exist in Antarctic and sub-Antarctic regions."},{"id":282,"claim":"Biodegradable means it disappears instantly in nature.","correction":"Biodegradation rates vary; some materials take years or need specific conditions."},{"id":283,"claim":"All ice at the poles is freshwater.","correction":"Sea ice and some polar ice contain salts; glacial ice is mostly fresh."},{"id":284,"claim":"Balloons rise because helium has negative weight.","correction":"Helium is less dense than air, creating buoyant force; it still has weight."},{"id":285,"claim":"Earth’s rotation has never changed.","correction":"Earth’s rotation is slowing slightly over time due to tidal friction."},{"id":286,"claim":"All water on Earth originated from comets only.","correction":"Earth’s water likely came from a mix of sources, including asteroids and early outgassing."},{"id":287,"claim":"Radio waves require a medium like sound does.","correction":"Radio waves are electromagnetic and propagate through vacuum."},{"id":288,"claim":"Every rainbow has seven distinct colors only.","correction":"Rainbows form a continuous spectrum; seven is a cultural division."},{"id":289,"claim":"Printer ink costs more than blood because companies collude exclusively.","correction":"Ink is expensive due to manufacturing, packaging, and business models; not because of biological scarcity."},{"id":290,"claim":"Fire in space cannot exist without gravity.","correction":"Combustion can occur in microgravity with supplied oxygen and fuel; flame shapes differ."},{"id":291,"claim":"Plants breathe oxygen only at night.","correction":"Plants respire continuously; photosynthesis produces oxygen in light."},{"id":292,"claim":"Alligators can live indefinitely if not hunted.","correction":"Alligators age and eventually die; they do not have biological immortality."},{"id":293,"claim":"Penguins are monogamous for life without exception.","correction":"Many penguin species can change mates between seasons."},{"id":294,"claim":"All cereals are whole grain if labeled multigrain.","correction":"Multigrain means multiple grains, not necessarily whole grains."},{"id":295,"claim":"Lightning is hotter than the Sun everywhere in the bolt.","correction":"Peak lightning temperatures exceed the Sun’s surface locally; not entire bolt length."},{"id":296,"claim":"Spiders drink through their feet.","correction":"Spiders absorb moisture through mouthparts; feet do not ingest water."},{"id":297,"claim":"Glass blocks all UV radiation.","correction":"Ordinary glass blocks most UVB but allows much UVA to pass."},{"id":298,"claim":"All birds migrate seasonally.","correction":"Many birds are resident and do not migrate."},{"id":299,"claim":"A watched pot never boils because observation changes heat.","correction":"Observation doesn’t affect boiling; it only feels longer."},{"id":300,"claim":"Coins thrown into wishing wells dissolve quickly and feed plants.","correction":"Coins corrode slowly; they can introduce metals harmful to water life."}]
