[{"id":1,"claim":"The Great Wall of China is visible from the Moon.","correction":"The Great Wall is not visible from the Moon with the naked eye."},{"id":2,"claim":"Lightning never strikes the same place twice.","correction":"Lightning can and does strike the same place multiple times."},{"id":3,"claim":"Humans only use 10% of their brains.","correction":"Humans use virtually all parts of the brain over time."},{"id":4,"claim":"Goldfish have a three-second memory.","correction":"Goldfish can remember things for months."},{"id":5,"claim":"Bats are blind.","correction":"Bats can see, and many also use echolocation."},{"id":6,"claim":"Vikings wore horned helmets.","correction":"Historical evidence shows Vikings did not wear horned helmets."},{"id":7,"claim":"Mount Everest is the closest point on Earth to space.","correction":"Mount Chimborazo’s summit is closer to space due to Earth’s equatorial bulge."},{"id":8,"claim":"Sugar causes hyperactivity in children.","correction":"Studies have not shown sugar to cause hyperactivity."},{"id":9,"claim":"Camels store water in their humps.","correction":"Camel humps store fat, not water."},{"id":10,"claim":"Vaccines cause autism.","correction":"Extensive research shows vaccines do not cause autism."},{"id":11,"claim":"The Sahara is the largest desert on Earth.","correction":"Antarctica is the largest desert."},{"id":12,"claim":"Eating carrots improves night vision dramatically.","correction":"Carrots help maintain eye health but do not grant exceptional night vision."},{"id":13,"claim":"A duck’s quack doesn’t echo.","correction":"Duck quacks do echo."},{"id":14,"claim":"Humans have five senses only.","correction":"Humans have additional senses like balance, temperature, and proprioception."},{"id":15,"claim":"Shaving makes hair grow back thicker.","correction":"Shaving does not change hair thickness or growth rate."},{"id":16,"claim":"Penguins live at the North Pole.","correction":"Penguins live in the Southern Hemisphere, primarily Antarctica."},{"id":17,"claim":"Bulls hate the color red.","correction":"Bulls react to motion, not the color red."},{"id":18,"claim":"Dropping a penny from a skyscraper can kill someone.","correction":"Air resistance prevents a penny from becoming lethal."},{"id":19,"claim":"Napoleon was very short.","correction":"Napoleon was around average height for his time."},{"id":20,"claim":"Chameleons change color to match any background perfectly.","correction":"Chameleons change color mainly for communication and temperature regulation."},{"id":21,"claim":"You should wait 24 hours before filing a missing person report.","correction":"Authorities can be contacted immediately when someone is missing."},{"id":22,"claim":"Humans evolved from modern apes.","correction":"Humans and modern apes share common ancestors but evolved separately."},{"id":23,"claim":"If you touch a baby bird, the mother will abandon it.","correction":"Most birds will not abandon chicks due to human scent."},{"id":24,"claim":"Black holes suck everything like vacuums.","correction":"Objects must cross the event horizon to be trapped; outside, gravity follows normal rules."},{"id":25,"claim":"All deserts are hot.","correction":"Deserts can be cold, such as Antarctica and the Gobi."},{"id":26,"claim":"You can see the Great Wall of China from low Earth orbit easily.","correction":"The Great Wall is difficult to see unaided from low Earth orbit."},{"id":27,"claim":"Bananas grow on trees.","correction":"Bananas grow on large herbs, not trees."},{"id":28,"claim":"Sugar dissolves faster in cold water than hot.","correction":"Sugar dissolves faster in hot water."},{"id":29,"claim":"Earth has only one moon.","correction":"Earth has one natural moon but occasionally has temporary mini-moons."},{"id":30,"claim":"Ostriches bury their heads in the sand.","correction":"Ostriches do not bury their heads; they may lower them to the ground when threatened."},{"id":31,"claim":"Coffee stunts your growth.","correction":"No evidence shows coffee stunts growth."},{"id":32,"claim":"Cracking knuckles causes arthritis.","correction":"Cracking knuckles is not linked to arthritis."},{"id":33,"claim":"Houseflies live only 24 hours.","correction":"Houseflies typically live weeks to a month."},{"id":34,"claim":"Everest is the tallest mountain from base to peak.","correction":"Mauna Kea is taller from base to peak when measured from its ocean floor base."},{"id":35,"claim":"Seasons are caused by Earth being closer to the Sun in summer.","correction":"Seasons are caused by Earth’s axial tilt, not distance to the Sun."},{"id":36,"claim":"Tomatoes are always vegetables.","correction":"Botanically tomatoes are fruits; culinarily they are treated as vegetables."},{"id":37,"claim":"Glass is a slow-moving liquid.","correction":"Glass is an amorphous solid at room temperature."},{"id":38,"claim":"Humans and dinosaurs lived together.","correction":"Non-avian dinosaurs went extinct about 65 million years before humans appeared."},{"id":39,"claim":"Dogs see only in black and white.","correction":"Dogs see limited colors, mainly blues and yellows."},{"id":40,"claim":"Plants get most of their mass from soil.","correction":"Plants gain most mass from carbon dioxide in the air."},{"id":41,"claim":"Einstein failed math as a student.","correction":"Einstein excelled in math from a young age."},{"id":42,"claim":"Toads give you warts.","correction":"Warts are caused by viruses, not toads."},{"id":43,"claim":"The Moon is made of cheese.","correction":"The Moon is made of rock and metal."},{"id":44,"claim":"Space is completely empty.","correction":"Space contains particles, radiation, and fields, though very sparse."},{"id":45,"claim":"If food drops, it’s safe if picked up within five seconds.","correction":"Contamination can happen instantly regardless of time on the floor."},{"id":46,"claim":"Brown eggs are more nutritious than white eggs.","correction":"Eggshell color does not determine nutritional content."},{"id":47,"claim":"Sharks can smell a single drop of blood miles away.","correction":"Sharks have keen smell but not to that extreme distance."},{"id":48,"claim":"Microwaves cook from the inside out.","correction":"Microwaves heat food by exciting water molecules unevenly from the outside inward."},{"id":49,"claim":"Humans have four blood types only.","correction":"There are more than four blood group systems; ABO with Rh is just one."},{"id":50,"claim":"Bamboo is a tree.","correction":"Bamboo is a grass."},{"id":51,"claim":"Earth is larger than all other planets in the solar system.","correction":"Jupiter and Saturn are much larger than Earth."},{"id":52,"claim":"All snakes are venomous.","correction":"Most snake species are non-venomous."},{"id":53,"claim":"Poinsettias are deadly if eaten.","correction":"Poinsettias are mildly irritating but not deadly to humans."},{"id":54,"claim":"Diamonds are rare.","correction":"Gem-quality diamonds are common; rarity is market-managed."},{"id":55,"claim":"Birds will reject eggs touched by humans.","correction":"Most birds will continue to incubate eggs despite human scent."},{"id":56,"claim":"Antibiotics kill viruses.","correction":"Antibiotics target bacteria, not viruses."},{"id":57,"claim":"An octopus has nine hearts.","correction":"An octopus has three hearts."},{"id":58,"claim":"Black belts always mean mastery.","correction":"Belt meanings vary by martial art and school; black belt is not universal mastery."},{"id":59,"claim":"A coin flip is always a 50/50 outcome.","correction":"Real flips can be biased by technique and coin design."},{"id":60,"claim":"Humans can’t breathe and swallow at the same time because of size.","correction":"The epiglottis mechanism, not size, prevents simultaneous breathing and swallowing."},{"id":61,"claim":"Spinach is extremely high in iron because of a decimal error.","correction":"Spinach has modest iron; the decimal error story is itself a myth."},{"id":62,"claim":"Babies are born without kneecaps.","correction":"Babies have cartilage that later ossifies into kneecaps."},{"id":63,"claim":"Car batteries last indefinitely if unused.","correction":"Car batteries self-discharge and degrade over time."},{"id":64,"claim":"Copper is magnetic.","correction":"Copper is not ferromagnetic."},{"id":65,"claim":"Alcohol warms you up in cold weather.","correction":"Alcohol dilates blood vessels, making you lose heat faster."},{"id":66,"claim":"Humans glow in the dark visibly.","correction":"Humans emit faint bioluminescence not visible to the eye."},{"id":67,"claim":"Oxygen is the most abundant element in the universe.","correction":"Hydrogen is the most abundant element in the universe."},{"id":68,"claim":"Earth’s core is hollow.","correction":"Earth’s core is solid inner and liquid outer layers, not hollow."},{"id":69,"claim":"All clouds are white.","correction":"Clouds can appear gray or black depending on thickness and lighting."},{"id":70,"claim":"A year is exactly 365 days.","correction":"A year is about 365.2422 days; leap years adjust for this."},{"id":71,"claim":"Michelangelo painted the Sistine Chapel ceiling lying down.","correction":"He painted mostly standing on scaffolding."},{"id":72,"claim":"Bulls are enraged by red capes only.","correction":"Movement of the cape, not its color, provokes bulls."},{"id":73,"claim":"The human tongue has distinct taste zones.","correction":"All taste buds can detect multiple tastes, not strictly zoned."},{"id":74,"claim":"Coffee beans are beans.","correction":"Coffee beans are seeds of the coffee berry."},{"id":75,"claim":"Earth is perfectly round.","correction":"Earth is an oblate spheroid, slightly flattened at the poles."},{"id":76,"claim":"Lightning never strikes airplanes.","correction":"Airplanes are struck by lightning and are designed to handle it."},{"id":77,"claim":"Peanuts are true nuts.","correction":"Peanuts are legumes."},{"id":78,"claim":"All spiders spin webs.","correction":"Many spiders do, but some hunt without webs."},{"id":79,"claim":"You can get a cold from cold weather.","correction":"Colds are caused by viruses, though cold weather can influence exposure."},{"id":80,"claim":"Great Barrier Reef is dead entirely.","correction":"The reef is threatened and partially damaged but not entirely dead."},{"id":81,"claim":"Sugar substitutes have zero calories always.","correction":"Some substitutes have minimal calories; labels may round down."},{"id":82,"claim":"All bacteria are harmful.","correction":"Many bacteria are beneficial or harmless."},{"id":83,"claim":"Earth is the center of the solar system.","correction":"The Sun is at the center of the solar system."},{"id":84,"claim":"Whales are fish.","correction":"Whales are mammals."},{"id":85,"claim":"An earthworm cut in half becomes two worms.","correction":"Usually only the head end may survive; two full worms do not form."},{"id":86,"claim":"If you swallow gum, it stays for seven years.","correction":"Gum passes through the digestive system in days."},{"id":87,"claim":"Deserts have no life.","correction":"Deserts host diverse adapted life."},{"id":88,"claim":"All stars are yellow like the Sun.","correction":"Stars vary in color and temperature."},{"id":89,"claim":"Solar panels store energy.","correction":"Solar panels generate electricity; storage requires separate batteries."},{"id":90,"claim":"Metal spoons cool down hot drinks quickly.","correction":"They conduct heat away slightly, but the effect is small."},{"id":91,"claim":"Vitamin C prevents all colds.","correction":"Vitamin C may slightly reduce duration but does not prevent all colds."},{"id":92,"claim":"Earth’s gravity is zero in orbit.","correction":"Gravity acts in orbit; objects fall continuously creating weightlessness."},{"id":93,"claim":"All octopuses have eight hearts.","correction":"Octopuses have three hearts."},{"id":94,"claim":"Honey spoils quickly.","correction":"Honey can last indefinitely if sealed properly."},{"id":95,"claim":"Polar bears eat penguins.","correction":"Polar bears live in the Arctic; penguins live in the Southern Hemisphere."},{"id":96,"claim":"A tomato is a root vegetable.","correction":"Tomatoes are fruits that grow on vines above ground."},{"id":97,"claim":"Humans can see in complete darkness after adjusting.","correction":"Without light, humans cannot see; adaptation only improves low-light vision."},{"id":98,"claim":"Stonehenge was built by Romans.","correction":"Stonehenge predates Roman Britain by millennia."},{"id":99,"claim":"All tides are caused solely by the Moon.","correction":"Tides are influenced by both the Moon and the Sun."},{"id":100,"claim":"Microbes cannot survive in extreme heat.","correction":"Extremophiles thrive in very hot environments like hydrothermal vents."},{"id":101,"claim":"Coins thrown in fountains are retrieved by no one.","correction":"Many places collect and donate or process fountain coins."},{"id":102,"claim":"Spicy food causes stomach ulcers directly.","correction":"Most ulcers are caused by H. pylori bacteria or NSAID overuse."},{"id":103,"claim":"Water conducts electricity perfectly.","correction":"Pure water is a poor conductor; impurities carry current."},{"id":104,"claim":"Earth’s atmosphere is mostly oxygen.","correction":"Earth’s atmosphere is mostly nitrogen."},{"id":105,"claim":"An eclipse happens every month.","correction":"Eclipses are less frequent due to the Moon’s orbital tilt."},{"id":106,"claim":"Ants are lazy workers.","correction":"Ants are highly organized and efficient for their colonies."},{"id":107,"claim":"A day is exactly 24 hours.","correction":"A mean solar day is about 24 hours; it varies slightly."},{"id":108,"claim":"Hand dryers are always more sanitary than paper towels.","correction":"Some studies show paper towels can reduce bacteria spread more effectively."},{"id":109,"claim":"All mammals lay eggs.","correction":"Only monotremes like the platypus and echidna lay eggs."},{"id":110,"claim":"Cacti require frequent watering.","correction":"Cacti are adapted to infrequent watering."},{"id":111,"claim":"Water boils at 100°C everywhere on Earth.","correction":"Boiling point varies with atmospheric pressure and altitude."},{"id":112,"claim":"Alligators and crocodiles are the same.","correction":"They are different species with distinct traits and habitats."},{"id":113,"claim":"Chess can always be won with perfect play.","correction":"With perfect play, chess is believed to be a draw."},{"id":114,"claim":"Lightning only strikes during rain.","correction":"Lightning can strike outside rain, including dry lightning."},{"id":115,"claim":"All fossils are bones.","correction":"Fossils can be imprints, casts, or traces; not only bones."},{"id":116,"claim":"Alcohol kills all germs instantly.","correction":"Alcohol can reduce many germs but not all, and needs proper concentration/time."},{"id":117,"claim":"Water going down a drain spins opposite ways in hemispheres always.","correction":"Drain direction is dominated by basin shape and flow, not the Coriolis effect at that scale."},{"id":118,"claim":"Owls can turn their heads full circle.","correction":"Owls can rotate heads about 270 degrees, not 360."},{"id":119,"claim":"Black cats are bad luck.","correction":"Black cats are not inherently linked to luck."},{"id":120,"claim":"You can charge your phone faster in the freezer.","correction":"Cold slows battery performance and is harmful; it won’t charge faster."},{"id":121,"claim":"All metals are solid at room temperature.","correction":"Mercury is liquid at room temperature."},{"id":122,"claim":"Birds sleep while flying always.","correction":"Some birds can sleep unihemispherically during long flights; many do not."},{"id":123,"claim":"Vitamins replace the need for food.","correction":"Vitamins supplement diet but do not replace the need for food."},{"id":124,"claim":"Wearing glasses worsens eyesight over time.","correction":"Glasses do not weaken eyesight; they correct vision."},{"id":125,"claim":"All icebergs are white.","correction":"Icebergs can appear blue or even green depending on structure and algae."},{"id":126,"claim":"Sushi means raw fish.","correction":"Sushi refers to vinegared rice; toppings may or may not be raw fish."},{"id":127,"claim":"Mosquitoes are attracted solely to light.","correction":"Mosquitoes are attracted to CO2, body heat, and odors more than light."},{"id":128,"claim":"Memory foam remembers forever.","correction":"Memory foam slowly returns to shape; it doesn’t store memories."},{"id":129,"claim":"All rainforest soil is rich and fertile.","correction":"Many rainforest soils are nutrient-poor; nutrients are mostly in biomass."},{"id":130,"claim":"Candles burn without oxygen.","correction":"Combustion requires oxygen; a candle goes out in an oxygen-free space."},{"id":131,"claim":"Chocolate causes acne directly for everyone.","correction":"Diet’s effect on acne varies; chocolate alone isn’t a universal cause."},{"id":132,"claim":"Earthquakes happen only on land.","correction":"Many earthquakes occur under oceans on tectonic boundaries."},{"id":133,"claim":"Hermit crabs make their own shells.","correction":"Hermit crabs occupy discarded shells from other animals."},{"id":134,"claim":"All plastics are non-recyclable.","correction":"Many plastics are recyclable, depending on type and facilities."},{"id":135,"claim":"Planes dump toilet waste mid-flight routinely.","correction":"Toilet waste is stored and disposed of after landing."},{"id":136,"claim":"LED bulbs contain mercury like CFLs.","correction":"LED bulbs do not contain mercury."},{"id":137,"claim":"Bluetooth is named after a color technology.","correction":"Bluetooth is named after Harald Bluetooth, a Danish king."},{"id":138,"claim":"A leap year happens every four years without exception.","correction":"Century years must be divisible by 400 to be leap years."},{"id":139,"claim":"Sharks must keep moving or they die from lack of oxygen always.","correction":"Some sharks can pump water over gills while resting."},{"id":140,"claim":"Rainbows are full circles visible from the ground.","correction":"From the ground we see an arc; from above, rainbows can appear circular."},{"id":141,"claim":"Oil and water always separate immediately.","correction":"Emulsifiers can keep oil and water mixed temporarily."},{"id":142,"claim":"All fire extinguishers work the same way.","correction":"Different extinguishers use water, foam, CO2, or chemicals for specific fires."},{"id":143,"claim":"Boiling removes all microbes instantly.","correction":"Boiling reduces microbes but may require time to ensure safety."},{"id":144,"claim":"Starfish are fish.","correction":"Starfish (sea stars) are echinoderms, not fish."},{"id":145,"claim":"Mars is red because of hot lava.","correction":"Mars is red due to iron oxide dust."},{"id":146,"claim":"Rain always comes from gray clouds only.","correction":"Rain can fall from various cloud types, often appearing gray due to thickness."},{"id":147,"claim":"Humans cannot digest any fiber.","correction":"Humans cannot digest fiber for energy but it aids digestion and gut health."},{"id":148,"claim":"Earth’s magnetic poles never change.","correction":"Magnetic poles drift and have reversed many times in history."},{"id":149,"claim":"Thunder occurs first, then lightning.","correction":"Lightning occurs first; thunder is the sound following it."},{"id":150,"claim":"A compass points to true north always.","correction":"A compass points to magnetic north, which differs from true north."}]
