[{"id":301,"claim":"Sharks cannot swim backwards at all.","correction":"Most sharks cannot swim tail-first but can maneuver slightly backward with body movements."},{"id":302,"claim":"Mountains form only from volcanoes.","correction":"Many mountains form from tectonic uplift and folding, not just volcanism."},{"id":303,"claim":"Earth is closer to the Sun in summer worldwide.","correction":"The Northern Hemisphere’s summer occurs when Earth is farther from the Sun; seasons depend on tilt."},{"id":304,"claim":"Drinking hot liquids kills viruses in the throat.","correction":"Hot drinks may soothe but do not kill viruses in the body."},{"id":305,"claim":"Colorless chemicals are always harmless.","correction":"Toxic chemicals can be colorless; safety depends on properties, not color."},{"id":306,"claim":"All comets come from the asteroid belt.","correction":"Comets originate mainly from the Kuiper Belt and Oort Cloud."},{"id":307,"claim":"Every meteor that hits Earth becomes a meteorite visible on the ground.","correction":"Most meteors burn up; only some fragments reach the surface as meteorites."},{"id":308,"claim":"Cloud seeding always guarantees rain.","correction":"Cloud seeding can influence precipitation under specific conditions but doesn’t ensure rain."},{"id":309,"claim":"The Pacific Ocean is always deeper than the Atlantic at every point.","correction":"The Pacific has deeper trenches, but depth varies; some Atlantic spots exceed many Pacific areas."},{"id":310,"claim":"Only snakes shed skin.","correction":"Many animals shed skin, including lizards, insects, and humans continually."},{"id":311,"claim":"A person’s hair turns white overnight from shock.","correction":"Hair color changes gradually; sudden whitening is not supported biologically."},{"id":312,"claim":"Mercury thermometers are still the standard in all hospitals.","correction":"Most healthcare uses digital or alcohol thermometers; mercury types are being phased out."},{"id":313,"claim":"Eating bread makes glue in your stomach.","correction":"Digestion breaks down bread; no glue forms."},{"id":314,"claim":"All iguanas are green.","correction":"Iguanas come in various colors, including blue, orange, and red hues."},{"id":315,"claim":"Humans cannot survive more than three days without water under any circumstance.","correction":"Survival time varies with conditions; some have survived longer or less depending on environment."},{"id":316,"claim":"All citrus fruits come from Asia originally.","correction":"Many citrus species originated in Southeast Asia, but some relatives arose elsewhere."},{"id":317,"claim":"Antibiotics in meat remain active in cooked food.","correction":"Cooking degrades residual antibiotics; regulations limit residues."},{"id":318,"claim":"If you cut a flatworm, both halves always regenerate into full worms of equal size.","correction":"Regeneration depends on species and cut location; outcomes vary."},{"id":319,"claim":"Cats purr only when happy.","correction":"Cats also purr when stressed, in pain, or healing."},{"id":320,"claim":"Rainforests always have poor visibility because of constant rain.","correction":"Rainforests vary; rain is episodic, not constant."},{"id":321,"claim":"Only humans use tools.","correction":"Many animals, including primates, birds, and dolphins, use tools."},{"id":322,"claim":"Oxygen therapy is always harmless.","correction":"Excess oxygen can be harmful; therapy requires proper dosing."},{"id":323,"claim":"The speed of light is constant in all materials.","correction":"Light slows in media relative to vacuum; its vacuum speed is constant."},{"id":324,"claim":"All deserts are expanding rapidly due to climate change alone.","correction":"Some deserts expand while others shrink; land use and climate both affect boundaries."},{"id":325,"claim":"Space has a universal up and down.","correction":"In microgravity, orientation is relative; there is no universal up or down."},{"id":326,"claim":"Electric eels are true eels.","correction":"Electric eels are knifefish, not true eels."},{"id":327,"claim":"Only female mosquitoes bite humans.","correction":"Female mosquitoes bite for blood; males typically feed on nectar."},{"id":328,"claim":"All marine mammals have blubber of the same thickness.","correction":"Blubber thickness varies by species, age, and environment."},{"id":329,"claim":"Egyptian hieroglyphs were the first writing system.","correction":"Other early scripts like Sumerian cuneiform predate or are contemporaneous."},{"id":330,"claim":"Birds don’t have a sense of smell.","correction":"Many birds have well-developed olfaction."},{"id":331,"claim":"The Milky Way is the largest galaxy in the universe.","correction":"Many galaxies, such as Andromeda and giant ellipticals, are larger."},{"id":332,"claim":"Only male lions hunt.","correction":"Lionesses perform most hunts; males also hunt when needed."},{"id":333,"claim":"All frogs live mostly in water.","correction":"Many frog species spend significant time on land; some are arboreal or desert-adapted."},{"id":334,"claim":"Time passes more slowly on mountaintops than at sea level.","correction":"Time runs slightly faster at higher altitude due to weaker gravity."},{"id":335,"claim":"The color of smoke always indicates fuel type only.","correction":"Smoke color depends on temperature, fuel, and combustion completeness."},{"id":336,"claim":"Coral reefs are made of plants.","correction":"Reefs are built by animals (coral polyps) with symbiotic algae."},{"id":337,"claim":"All alcohol evaporates from food during cooking.","correction":"Cooking reduces but may not remove all alcohol depending on time and method."},{"id":338,"claim":"Whales breathe through their mouths underwater.","correction":"Whales breathe air through blowholes at the surface."},{"id":339,"claim":"All lakes are fresh water.","correction":"Some lakes, like the Great Salt Lake, are saline."},{"id":340,"claim":"Red sky at night always means good weather the next day worldwide.","correction":"The saying works regionally; weather depends on many factors."},{"id":341,"claim":"All amphibians must stay moist constantly.","correction":"Some amphibians tolerate drier conditions and have protective adaptations."},{"id":342,"claim":"Coins are always made of pure metal listed on them.","correction":"Most coins are alloys or plated for durability and cost."},{"id":343,"claim":"Ultrasound can shatter kidney stones inside the body instantly without side effects.","correction":"Lithotripsy can fragment stones but may cause pain, bruising, or complications."},{"id":344,"claim":"All bacteria die in a standard freezer.","correction":"Freezing can inactivate some bacteria but many survive and revive when thawed."},{"id":345,"claim":"Crocodiles cry to lure prey.","correction":"Tear secretion in crocodiles is unrelated to luring prey."},{"id":346,"claim":"Mars has liquid water oceans today.","correction":"No liquid surface oceans exist; water is locked as ice or vapor."},{"id":347,"claim":"Only Earth has plate tectonics.","correction":"Evidence suggests possible tectonic-like activity on bodies like Europa and ancient Mars."},{"id":348,"claim":"An airplane door can be opened mid-flight by a passenger.","correction":"Cabin pressure and door mechanisms prevent opening at cruising altitude."},{"id":349,"claim":"All seeds need light to germinate.","correction":"Many seeds germinate best in darkness; requirements vary by species."},{"id":350,"claim":"A diamond test with glass is conclusive.","correction":"Scratching glass is not a definitive diamond test; other materials can do it."},{"id":351,"claim":"You lose most body heat through your head.","correction":"Heat loss depends on exposed area; any uncovered part loses heat similarly."},{"id":352,"claim":"Chocolate is deadly to all animals equally.","correction":"Toxicity varies; dogs are sensitive, some animals tolerate more, others less."},{"id":353,"claim":"Spacecraft rely on air to push against for thrust.","correction":"Spacecraft use reaction mass expelled for thrust; no air is needed."},{"id":354,"claim":"Sunburn is not possible in winter.","correction":"UV exposure can cause sunburn in any season, especially at altitude or on snow."},{"id":355,"claim":"All sound needs a physical medium; radio proves otherwise.","correction":"Radio waves are electromagnetic, not sound; sound does require a medium."},{"id":356,"claim":"Camels are native to only the Middle East.","correction":"Camels are native to parts of Asia and Africa; related camelids are native to South America."},{"id":357,"claim":"All salt is made of sodium chloride only.","correction":"Salts are a broad class of compounds; table salt is sodium chloride."},{"id":358,"claim":"Globally, winter occurs at the same time everywhere.","correction":"Seasons are opposite between hemispheres."},{"id":359,"claim":"All bees make honey.","correction":"Only some species, like honeybees, produce significant honey."},{"id":360,"claim":"Tennis balls were always yellow historically.","correction":"Tennis balls were originally white; yellow became standard for visibility."},{"id":361,"claim":"Polar ice caps are pure white because ice is colorless.","correction":"Ice can appear blue; white comes from air bubbles scattering light."},{"id":362,"claim":"Paper cuts bleed less because paper is sterile.","correction":"Paper isn’t sterile; the shallow cut and vessel size limit bleeding."},{"id":363,"claim":"Crystals grow only in caves over millions of years.","correction":"Crystals can form in labs or nature over varied timescales, from minutes to eons."},{"id":364,"claim":"All mountains stop growing once formed.","correction":"Mountains can still uplift or erode depending on tectonics and climate."},{"id":365,"claim":"Hand sanitizer works better the more you use it consecutively.","correction":"Effectiveness depends on proper single use and contact time; overuse doesn’t amplify results."},{"id":366,"claim":"All lightning bolts strike from cloud to ground.","correction":"Lightning can be cloud-to-cloud, intra-cloud, or ground-to-cloud."},{"id":367,"claim":"The North Pole has penguins and polar bears together.","correction":"Polar bears live in the Arctic; penguins live in the Southern Hemisphere."},{"id":368,"claim":"You can’t get dehydrated in humid climates.","correction":"High humidity can still lead to dehydration, especially with sweating."},{"id":369,"claim":"Humans cannot taste water.","correction":"Humans can perceive taste qualities of water, especially impurities."},{"id":370,"claim":"All bats hibernate.","correction":"Some bat species migrate or remain active depending on climate."},{"id":371,"claim":"Every rainbow needs rain.","correction":"Rainbows form from water droplets; mist or spray can create them without rain."},{"id":372,"claim":"Gold cannot rust or tarnish in any environment.","correction":"Gold is highly resistant but can tarnish slightly in some chemical conditions or alloys."},{"id":373,"claim":"The vacuum of space sucks objects out of spacecraft violently when a door opens.","correction":"Pressure equalizes rapidly, but objects move due to pressure differential, not suction force."},{"id":374,"claim":"All planets rotate counterclockwise when viewed from above the North Pole.","correction":"Venus and Uranus rotate retrograde compared to most planets."},{"id":375,"claim":"Spiders create identical webs every time.","correction":"Web design varies with species, environment, and damage."},{"id":376,"claim":"You cannot start a fire with ice.","correction":"Clear ice lenses can focus sunlight enough to start a fire under ideal conditions."},{"id":377,"claim":"Every snake injects venom through hollow fangs.","correction":"Many snakes are nonvenomous; some venomous species have grooved fangs."},{"id":378,"claim":"Earth’s atmosphere is mostly carbon dioxide.","correction":"Nitrogen and oxygen dominate; CO2 is a trace gas."},{"id":379,"claim":"Lightning never strikes the same cloud twice.","correction":"Cloud regions can be struck repeatedly during a storm."},{"id":380,"claim":"The Great Barrier Reef is a single coral colony.","correction":"It is a vast system of thousands of reefs and islands."},{"id":381,"claim":"All birds build nests in trees.","correction":"Birds nest in varied places: ground, cliffs, burrows, buildings."},{"id":382,"claim":"Every star we see is part of the Milky Way except the Sun.","correction":"All naked-eye stars are in the Milky Way; other galaxies appear as diffuse objects."},{"id":383,"claim":"Moonlight is sunlight cooled by space.","correction":"Moonlight is sunlight reflected off the lunar surface without cooling into visible light."},{"id":384,"claim":"Frogs breathe only through skin underwater.","correction":"Frogs use skin, lungs, and mouth lining; many breathe through skin in water."},{"id":385,"claim":"Birds sleep only at night.","correction":"Bird sleep patterns vary; some nap by day and fly at night."},{"id":386,"claim":"Plants grow faster to music because they hear it like animals.","correction":"Any effects are due to vibration or environmental factors, not hearing."},{"id":387,"claim":"A tsunami is just a very big tide.","correction":"Tsunamis are seismic or landslide-driven waves, not tides."},{"id":388,"claim":"Night vision goggles emit harmful radiation to the eyes.","correction":"They amplify light or use infrared sensors; emissions are minimal in normal use."},{"id":389,"claim":"Every hurricane has an eye.","correction":"Weak tropical storms may lack a well-defined eye."},{"id":390,"claim":"All ants bite humans.","correction":"Some ants bite, others sting, and many do neither routinely."},{"id":391,"claim":"Lead pencils contain lead.","correction":"Pencils use graphite, not lead."},{"id":392,"claim":"All rocks sink in water.","correction":"Pumice can float due to trapped gas."},{"id":393,"claim":"All volcanoes are on land.","correction":"Most volcanoes lie underwater along mid-ocean ridges and arcs."},{"id":394,"claim":"Every marine fish drinks seawater continuously.","correction":"Many marine fish drink seawater; freshwater fish generally do not."},{"id":395,"claim":"Auroras occur only near the North Pole.","correction":"Auroras occur near both poles (aurora borealis and australis)."},{"id":396,"claim":"Drinking coffee depletes your body’s water completely.","correction":"Coffee contributes to hydration; diuretic effect is mild in regular users."},{"id":397,"claim":"Aluminum foil blocks all radio waves completely.","correction":"Foil can attenuate signals but doesn’t guarantee complete blocking without full enclosure."},{"id":398,"claim":"Earth is the only planet with clouds.","correction":"Planets like Venus, Jupiter, Mars, and Titan have clouds."},{"id":399,"claim":"All geckos can walk on any surface, including Teflon.","correction":"Gecko adhesion fails on some very smooth, low-surface-energy materials like Teflon."},{"id":400,"claim":"The deepest ocean point is the Mariana Trench because of waterfall erosion.","correction":"It formed from plate subduction, not waterfall erosion."},{"id":401,"claim":"Earth’s magnetic field comes from a giant bar magnet inside Earth.","correction":"It arises from dynamo action in the liquid outer core."},{"id":402,"claim":"All glaciers move at the same speed.","correction":"Glacier speeds vary widely from centimeters to meters per day."},{"id":403,"claim":"Women have one more rib than men.","correction":"Typical rib counts are the same for men and women."},{"id":404,"claim":"Polar nights mean absolute darkness all winter.","correction":"Polar nights still have twilight and moonlight; not total darkness continuously."},{"id":405,"claim":"Monsoons are just heavy rains.","correction":"Monsoons are seasonal wind shifts that can bring wet or dry periods."},{"id":406,"claim":"Digital clocks are always more accurate than analog clocks.","correction":"Accuracy depends on the timekeeping mechanism, not display type."},{"id":407,"claim":"Only mammals nurse their young.","correction":"Mammals produce milk; some birds feed crop milk, but true nursing is mammalian."},{"id":408,"claim":"Heat lightning is a special lightning type without thunder.","correction":"It is distant lightning; thunder is unheard because of distance."},{"id":409,"claim":"Every planet has weather.","correction":"Not all bodies have atmospheres; without an atmosphere, weather as we know it doesn’t occur."},{"id":410,"claim":"Lightning is attracted to metal exclusively.","correction":"Lightning seeks the path of least resistance, often tall or conductive objects, not metal exclusively."},{"id":411,"claim":"All caves form from water erosion.","correction":"Caves can form from lava tubes, dissolution, wind, or tectonics."},{"id":412,"claim":"Long hair grows faster than short hair.","correction":"Growth rate is determined by follicles, not hair length."},{"id":413,"claim":"Human teeth are the hardest substance in the body because of bone.","correction":"Enamel is the hardest substance; it isn’t bone."},{"id":414,"claim":"Crows have the smallest bird brains relative to body size.","correction":"Crows have large, capable brains relative to body size."},{"id":415,"claim":"All deserts receive no rain in a year.","correction":"Deserts receive little rain; some get occasional precipitation."},{"id":416,"claim":"If pond water looks clear, it’s free of microbes.","correction":"Clear water can still contain microbes."},{"id":417,"claim":"Every river flows south.","correction":"Rivers flow downhill regardless of compass direction."},{"id":418,"claim":"Penguins are only black and white.","correction":"Some penguins have additional colors like yellow or orange markings."},{"id":419,"claim":"Only humans experience menopause.","correction":"Some whales also experience menopause."},{"id":420,"claim":"All gemstones are minerals.","correction":"Amber and jet are organic gems, not minerals."},{"id":421,"claim":"Blood in veins is blue until oxygenated.","correction":"Venous blood is dark red; veins look blue due to light scattering."},{"id":422,"claim":"Oxygen therapy is safe to self-administer from any source.","correction":"Medical oxygen requires prescription and proper administration."},{"id":423,"claim":"Planets make noise you could hear in space.","correction":"Space is a vacuum; sound cannot travel. Planetary emissions are detected as electromagnetic waves."},{"id":424,"claim":"Every cloud produces precipitation.","correction":"Many clouds dissipate without producing rain or snow."},{"id":425,"claim":"All birds have hollow bones.","correction":"Many birds have pneumatic bones, but some bones are solid or partly solid."},{"id":426,"claim":"Earth’s climate has been stable until recent industry.","correction":"Climate has varied naturally; recent rapid warming is strongly linked to human activity."},{"id":427,"claim":"Owning houseplants always increases indoor oxygen to outdoor levels.","correction":"Plants have minimal effect on indoor O2 compared to ventilation."},{"id":428,"claim":"All starfish can regenerate entire bodies from a single arm.","correction":"Regeneration ability varies; not all species or arm fragments can regrow whole bodies."},{"id":429,"claim":"Radioactivity makes things glow green automatically.","correction":"Most radioactive materials do not glow; some produce blue Cherenkov light in water."},{"id":430,"claim":"All soil is dark brown when healthy.","correction":"Soils vary in color depending on minerals, organic content, and moisture."},{"id":431,"claim":"Ice is always slippery because it is smooth.","correction":"A thin melt layer and pressure reduce friction; temperature affects slipperiness."},{"id":432,"claim":"Every volcano eruption includes lava flow.","correction":"Some eruptions are explosive with ash only and little to no lava flows."},{"id":433,"claim":"Earth’s sky would be black without oceans.","correction":"Sky color is due to atmospheric scattering; oceans are not required for blue sky."},{"id":434,"claim":"All lightning is white.","correction":"Lightning color can vary with temperature and particulates."},{"id":435,"claim":"Ants can live underwater indefinitely.","correction":"Some survive floods briefly via air pockets or rafts; they cannot live submerged indefinitely."},{"id":436,"claim":"Drinking vinegar balances blood pH quickly.","correction":"Human blood pH is tightly regulated; vinegar does not meaningfully change it in healthy individuals."},{"id":437,"claim":"Caffeine removes alcohol from your body faster.","correction":"Caffeine may increase alertness but does not speed alcohol metabolism."},{"id":438,"claim":"Piranhas will strip a cow to the bone in seconds universally.","correction":"Feeding frenzies are rare; behavior depends on species and conditions."},{"id":439,"claim":"The Moon has no gravity.","correction":"The Moon has about one-sixth of Earth’s gravity."},{"id":440,"claim":"Termites eat concrete.","correction":"Termites cannot digest concrete; they may tunnel through cracks."},{"id":441,"claim":"All trees produce oxygen only.","correction":"Trees respire and consume oxygen as well; net production depends on growth stage and conditions."},{"id":442,"claim":"You can always tell direction with moss on trees.","correction":"Moss grows where moisture and shade favor it; it’s not a reliable compass."},{"id":443,"claim":"All maps have north at the top.","correction":"Map orientation varies; north-up is a convention."},{"id":444,"claim":"All storms spin faster at the equator.","correction":"Coriolis effect is weakest at the equator; storm rotation is more pronounced away from it."},{"id":445,"claim":"Blood is blue in veins because it lacks iron.","correction":"Blood contains iron; deoxygenated blood is dark red."},{"id":446,"claim":"Only men can be colorblind.","correction":"Colorblindness is more common in men but can occur in women."},{"id":447,"claim":"Kangaroos cannot walk backward because of knee structure only.","correction":"Tail and body design limit backward movement; knees are not the sole reason."},{"id":448,"claim":"All snow is white.","correction":"Snow can appear pink (watermelon snow) or gray with impurities or algae."},{"id":449,"claim":"Sunflowers always contain sunflower oil naturally in liquid form.","correction":"Oil is stored in seeds and must be extracted."},{"id":450,"claim":"Earth’s oceans are uniformly salty.","correction":"Salinity varies by location, depth, and freshwater input or evaporation."}]
